tutorials/multiphase/interFoam/RAS/DTCHullMoving/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (-1.668 0 0);

boundaryField
{
    atmosphere
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity uniform (-1.668 0 0);
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (-1.668 0 0);
    }
    outlet
    {
        type            outletPhaseMeanVelocity;
        UnMean          constant 1.668;
        alpha           alpha.water;
        value           uniform (-1.668 0 0);
    }
    bottom
    {
        type            symmetryPlane;
    }
    side
    {
        type            symmetryPlane;
    }
    midPlane
    {
        type            symmetryPlane;
    }
    hull
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
